src/app/Models/CongeModel.php

    public function getCongesByEmploye($employeId)
    {
        return $this->select('conges.*, types_conge.libelle as type_conge')
                    ->join('types_conge', 'types_conge.id = conges.type_conge_id')
                    ->where('employe_id', $employeId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT `conges`.*, `types_conge`.`libelle` as `type_conge`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `employe_id` = 3
ORDER BY `created_at` DESC

    public function getDemandes(?string $statut = null, ?int $departementId = null): array
    {
        $builder = $this->select('conges.*, employes.nom, employes.prenom, employes.departement_id, departements.nom as departement, types_conge.libelle as type_conge')
            ->join('employes', 'employes.id = conges.employe_id')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->orderBy('created_at', 'DESC');

        if ($statut) {
            $builder->where('conges.statut', $statut);
        }

        if ($departementId) {
            $builder->where('employes.departement_id', $departementId);
        }

        return $builder->findAll();
---
SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `employes`.`departement_id`, `departements`.`nom` as `departement`, `types_conge`.`libelle` as `type_conge`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'en_attente'
ORDER BY `created_at` DESC