src/app/Models/EmployeModel.php

SELECT *
FROM `employes`
WHERE `email` = 'admin@techmada.mg'
 LIMIT 1
---
    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)->first();