src/app/Models/SoldeModel.php

    public function getSoldesByEmploye($employeId, $annee = null)
    {
        if (!$annee) {
            $annee = date('Y');
        }
        return $this->select('soldes.*, types_conge.libelle, types_conge.deductible')
                    ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
                    ->where('employe_id', $employeId)
                    ->where('annee', $annee)
                    ->findAll();
---
SELECT `soldes`.*, `types_conge`.`libelle`, `types_conge`.`deductible`
FROM `soldes`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `employe_id` = 3
AND `annee` = '2026'