src/app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `employes`
WHERE `actif` = 1
SELECT COUNT(*) AS `numrows`
FROM `departements`
---
    public function index()
    {
        $congeModel = new CongeModel();
        $employeModel = new EmployeModel();
        $departementModel = new DepartementModel();

        $data['pendingCount'] = count($congeModel->getDemandes('en_attente'));
        $data['employeCount'] = $employeModel->where('actif', 1)->countAllResults();
        $data['departementCount'] = $departementModel->countAllResults();

SELECT *
FROM `departements`
ORDER BY `nom` ASC
SELECT `employes`.*, `departements`.`nom` as `departement`
FROM `employes`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
ORDER BY `employes`.`nom` ASC
---
    public function employes()
    {
        helper('form');
        $employeModel = new EmployeModel();
        $departementModel = new DepartementModel();

        $data['departements'] = $departementModel->orderBy('nom', 'ASC')->findAll();
        $data['employes'] = $employeModel
            ->select('employes.*, departements.nom as departement')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->orderBy('employes.nom', 'ASC')
            ->findAll();

SELECT `soldes`.*, `employes`.`nom`, `employes`.`prenom`, `types_conge`.`libelle` as `type_conge`
FROM `soldes`
JOIN `employes` ON `employes`.`id` = `soldes`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
ORDER BY `employes`.`nom` ASC
SELECT *
FROM `employes`
WHERE `actif` = 1
ORDER BY `nom` ASC
SELECT *
FROM `types_conge`
WHERE `deductible` = 1
---
    public function soldes()
    {
        $soldeModel = new SoldeModel();
        $employeModel = new EmployeModel();
        $typeCongeModel = new TypeCongeModel();

        $data['soldes'] = $soldeModel
            ->select('soldes.*, employes.nom, employes.prenom, types_conge.libelle as type_conge')
            ->join('employes', 'employes.id = soldes.employe_id')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->orderBy('employes.nom', 'ASC')
            ->findAll();

        $data['employes'] = $employeModel->where('actif', 1)->orderBy('nom', 'ASC')->findAll();
        $data['typesConge'] = $typeCongeModel->where('deductible', 1)->findAll();