src/app/Controllers/CalendrierController.php

    public function index()
    {
        $session = session();
        $employeId = $session->get('id');
        $congeModel = new CongeModel();
        $soldeModel = new SoldeModel();
        $typeCongeModel = new TypeCongeModel();
        $data['conges'] = $congeModel->getCongesByEmploye($employeId);
        $data['soldes'] = $soldeModel->getSoldesByEmploye($employeId);
        $data['typesConge'] = $typeCongeModel->findAll();
---
SELECT *
FROM `types_conge`

    public function events()
    {
        $session = session();
        $employId = (int) $session->get('id');
        $model = new CongeModel();

        $conges = $model->where('employe_id', $employId)->findAll();
---
SELECT *
FROM `conges`
WHERE `employe_id` = 3