src/app/Controllers/ChartController.php

SELECT *
FROM `types_conge`
---
    public function index()
    {
        $session = session();
        $employeId = $session->get('id');
        $congeModel = new CongeModel();
        $soldeModel = new SoldeModel();
        $typeCongeModel = new TypeCongeModel();
        $data['conges'] = $congeModel->getCongesByEmploye($employeId);
        $data['soldes'] = $soldeModel->getSoldesByEmploye($employeId);
         $data['typesConge'] = $typeCongeModel->findAll();