src/app/Controllers/EmployeController.php

SELECT *
FROM `types_conge`
---
    public function create()
    {
        helper('form');

        $session = session();
        $employeId = $session->get('id');

        $soldeModel = new SoldeModel();
        $typeCongeModel = new TypeCongeModel();

        $data['soldes'] = $soldeModel->getSoldesByEmploye($employeId);
        $data['typesConge'] = $typeCongeModel->findAll();

SELECT *
FROM `employes`
WHERE `employes`.`id` = 3
---
    public function profil()
    {
        helper('form');
        $session = session();
        $employeId = $session->get('id');

        $employeModel = new EmployeModel();
        $data['employe'] = $employeModel->find($employeId);